Revit 2026 API

# IFCPropertyMappingInfoIFCPropertyName Property

---

The IFC property name.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string IFCPropertyName { get; set; }
```
```vb
Public Property IFCPropertyName As String
	Get
	Set
```
```cpp
public:
property String^ IFCPropertyName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member IFCPropertyName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

IFCPropertyMappingInfo Class

Autodesk.Revit.DB Namespace